{
  "ir_version": "1.0",
  "project": "schemago",
  "repository": "https://github.com/grokify/schemago",
  "releases": [
    {
      "version": "0.1.0",
      "date": "2025-01-17",
      "description": "Initial release with JSON Schema linter for Go compatibility",
      "added": [
        {"description": "CLI with `lint` and `version` commands using cobra"},
        {"description": "JSON Schema parser for linting (supports `$defs`, `definitions`, `anyOf`, `oneOf`)"},
        {"description": "Union detection with discriminator field analysis"},
        {"description": "Nullable pattern detection (`anyOf: [T, null]`)"},
        {"description": "Reference pattern detection (`anyOf: [ComponentReference, BaseXxx]`)"},
        {"description": "Configurable discriminator field priority (`component_type`, `type`, `kind`)"},
        {"description": "Multiple output formats: text (default), JSON, GitHub Actions annotations"},
        {"description": "Exit codes: 0 (ok), 1 (errors), 2 (warnings only)"}
      ],
      "documentation": [
        {"description": "Product Requirements Document (PRD.md)"},
        {"description": "Technical Requirements Document (TRD.md)"},
        {"description": "README with installation and usage instructions"}
      ]
    }
  ]
}
